app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Internet des objets"], ["body", "C'est quoi l'IOT?"], ["created_at", "2024-05-27 08:51:33.923780"], ["updated_at", "2024-05-27 08:51:33.923780"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)
    #@article.user_id = current_user.id
    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2024-06-04 14:04:45.892162"], ["status", "private"], ["id", 16]]
---
  def update
    @article =Article.find(params[:id])
    respond_to do |format|
      if @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy!